#include "stdafx.h"
#include "ConvertData.h"

using namespace std;
int max_path = 0;

/***********************************************************************************************************
 * 程序作者：赵进军
 * 函数功能：构造函数
 * 参数说明：null
 * 注意事项：null
 * 修改日期：2015/12/02 22:33:00
 ***********************************************************************************************************/
ConvertData::ConvertData()
{
}


/***********************************************************************************************************
 * 程序作者：赵进军
 * 函数功能：析构函数
 * 参数说明：null
 * 注意事项：null
 * 修改日期：2015/12/02 22:33:00
 ***********************************************************************************************************/
ConvertData::~ConvertData()
{
}


/***********************************************************************************************************
 * 程序作者：赵进军
 * 函数功能：把char*数据类型转换成LPCWSTR  #define MAX_PATH 9
 * 参数说明：null
 * 注意事项：null
 * 修改日期：2015/12/02 22:35:00
 ***********************************************************************************************************/
LPCWSTR ConvertData::ConvertCharTo(char* sourceObj)
{
	WCHAR retObj[MAX_PATH];
	memset(retObj, 0, sizeof(retObj));
	MultiByteToWideChar(CP_ACP, 0, sourceObj, strlen(sourceObj) + 1, retObj, sizeof(retObj) / sizeof(retObj[0]));
	//MultiByteToWideChar(CP_ACP, 0, sourceObj, -1, retObj, sizeof(retObj));
	return retObj;
}